#print არის კოდი, რომელიც გარკვეული სიტყვის ან წინადადების დაწერის და ტერმინალში გაშვების საშუალებას გვაძლევს
#print-ის შემდეგ დაწერილი ბრძანება აუცილებლად უნდა ჩავსვათ ბრჩხილებში, რადგან როგორც ქართულ და უცხოურ ენებს, ისევე პროგრამირების
#ენებსაც გააჩნია გრამატიკა და წერის წესები

name="demetre"
print(name)

#ცვლადის შექმნას დეკლარაცია ეწოდება. დეკლარაციის 3 საფეხური:
# 1)ცვლადისთვის სახელის მოფიქრება
# 2)ტოლობის ოპერატორის დაწერა
# 3)ცვლადისთვის მნიშვნელობის მინიჭება

number=10
print(number)

number=20
print(number)

#ამ ცვლადს სახელად "number" აქვს მინიჭებული მნიშვნელობები 10 და 20, რაც აისახა ტერმინალში