# ციკლი არის იტერაციების(ერთი და იგივე მოქმედების ბევრჯერ გამეორების) ერთობლილობა.

# range - ინგლისურიდან ითარგმნება როგორც მანძილი. იგი საჭიროა სამი სახის არგუმენტის მისათითებლად: start, stop, step.
# start - რომელი რიცხვიდან უნდა დავიწყოთ ათვლა (ან რამდენჯერ უნდა გავამეორებინოთ გარკვეული მოქმედება)
# stop - რომელ რიცხვზე უნდა დავასრულოთ ათვლა (მითითებული რიცხვი არ შედის ციკლში)
# step - თუ რა ინტერვალებით უნდა დავითვალოთ რიცხვები (თუ არ მივუთითეთ, ინტერვალი default-ზე 1 იქნება)


for i in range(100, 201):
    print(i)

for i in range(20, 30, 3):
    print(i)

for i in range(0, 21, 2):
    print(i)


num = int(input())
a = num + i
for i in range(5):
    print(a)
print(a/5)