# / - ჩვეულებრივი გაყოფა.

# მაგ:
# 10 / 5 == 2
# 20 / 4 == 5
# 9 / 4 == 2.25


# // - ამ გაყოფის დროს პასუხში იწერება ის რიცხვი, რამდენჯერაც გამყოფი თავსდება გასაყოფში.

# მაგ:
# 7 / 3 == 2
# 19 / 6 == 3
# 37 / 7 == 5


# % - ამ გაყოფისას იწერება ნაშთი.

# მაგ:

# 4 % 3 == 1
# 15 % 5 == 0
# 36 % 8 == 4





# elif - else + if. ითარგმნება, როგორც "სხვა შემთხვევაში, თუ".
# elif-ი, ისევე, როგორც else, არის if-ისგან განსხვავებული შემთხვევა, მაგრამ else-სგან განსხვავებით, ჩვენ შეგვიძლია დავწეროთ elif-ი
# იმდენჯერ, რამდენჯერაც გვინდა, რადგან else არის if-ის სხვა ნებისმიერი შემთხვევა და ერთხელ დაწერაც საკმარისია, რადგან დაკონკრეტება არ
# სჭირდება. ხოლო elif-ი არის if-ისგან განსხვავებული კონკრეტული შემთხვევა, რომელსაც უკვე სჭირდება დაკონკრეტება, და რამდენი
# განსხვავებული კონკრეტული შემთხვევის დაწერაც გვინდა, იმდენი elif-ი უნდა დავწეროთ.


leap_year = int(input("enter leap year: "))

if leap_year % 4 == 0:
    print("this is leap year")
elif leap_year % 4 != 0:
    print("this is not leap year")