/* window - ობიექტი, რომელიც წარმოადგენს ბრაუზერში გახსნილ ფანჯარას,
სადაც გაეერთიანებულია ჯავასკრიპტის ყველა ობიექტი, ცვლადი და ფუნქია. */

/*
ცვლადის შექმნის სახეები:
    1) var - მოძველებული ფორმა, რომლის დროსაც var-ით შექმნილი ცვლადი ავტომატურად ხდება windows-ის ობიექტის თვისება
    2) const - ცვლადი, რომელსაც მუდმივი მნიშვნელობა გააჩნია
    3) let - უბრალო ცვლადი, რომლის რეინიციალიზება შეიძლება
*/

// var-ის გამოყენება ცუდი პრაქტიკაა, რადგან ანელებს მუშაობას. მაგრამ არ წაიშალა ძველი საიტების მუშაობის შესანარჩუნებლად

// increment - მნიშვნელობის ერთით გაზრდა
let a = 18;
a++;
console.log(a);

// decrement - მნიშვნელობის ერთით შემცირება
let b = 7;
b--;
console.log(b);

// String Literal არის ტექსტის ჩაწერის პირდაპირი გზა კოდში
let age = 25;
let sentence = `I am ${age} years old.`;

console.log(sentence);

const c = "Demetre"
console.log(typeof c);