num1 = int(input("enter first number: "))
num2 = int(input("enter second number: "))

def sum(number1, number2):
    return number1 * number2

print(sum(num1, num2))


# print არაფერს არ ასრულებს მის შემცველი არგუმენტის დაბეჭდვის გარდა
# return-ს კი გამოაქვს ფუნქციის საბოლოო პასუხი, რომელიც შემდეგში შეგვიძლია სხვადასხვა სიტუაციაში გამოვიყენოთ(მაგალითად სხვა
# ცვლადს გავუტოლოთ)
# return-ის არგუმენტი ფრჩხილებში არ უნდა ჩავსვათ, ასევე return-ის დაწერისას კოდის ბლოკი ჩერდება და მის მერე ბლოკში დაწერილი კოდები
# იგნორდება.