// default parameter - პარამეტრი, რომელსაც თავდაპირველად უკვე აქვს მნიშვნელობა, თუ ფუნქციას გამოძახებისას არ გადაეცემა არგუმენტი. მაგ:
const greet = (name = "stranger") => `Hello, ${name}!`;


const info = (name, age) => `my name is ${name}, i'm ${age} years old`;
// info('luka') დააბრუნებს "my name is luka, i'm undefined years old", რადგან პარამეტრი age არ გადაეცემა ფუნქციას.


// functinon declaration - იწყება სიტყვით function, რასაც მოჰყვება სახელი, პარამეტრები და ბოლოს სხეული. მაგ:
function add(a, b) {
    return a + b;
};

// function expression - ინახება ცვლადში. მაგ:
const multiply1 = function (a, b) {
    return a * b;
};
// ან
const multiply2 = (a, b) => a * b;


/*
        ჯავასკრიპტში სკოუპი (Scope), ანუ ხედვის არეალი, განსაზღვრავს, თუ კოდის რომელ ნაწილში გვაქვს წვდომა ამა თუ იმ ცვლადზე,
    ფუნქციასა თუ ობიექტზე. მარტივად რომ ვთქვათ, სკოუპი წყვეტს, სად არსებობს და საიდან ჩანს შენი ცვლადი.

    ჯავასკრიპტში ძირითადად სამი ტიპის სკოუპი გვაქვს:

    1. Global Scope (გლობალური არეალი)
        თუ ცვლადს აღწერ ნებისმიერი ფუნქციის ან ბლოკის ({}) გარეთ, ის ხდება გლობალური.
        ხელმისაწვდომობა: ასეთ ცვლადთან წვდომა გაქვს კოდის ნებისმიერი ადგილიდან (ფუნქციების შიგნიდანაც კი).
        გაფრთხილება: გლობალური ცვლადების გადამეტებული გამოყენება ცუდი პრაქტიკაა, რადგან კოდის სხვადასხვა ნაწილმა შეიძლება
        შემთხვევით შეცვალოს მათი მნიშვნელობა და ქაოსი გამოიწვიოს.

    2. Function Scope (ფუნქციური არეალი)
        თუ ცვლადს აღწერ ფუნქციის შიგნით, ის ხდება ფუნქციური.
        ხელმისაწვდომობა: ასეთ ცვლადთან წვდომა გაქვს მხოლოდ იმ ფუნქციის შიგნიდან, სადაც ის არის აღწერილი.
        გაფრთხილება: ფუნქციური ცვლადები არ ჩანს ფუნქციის გარეთ.

    3. Block Scope (ბლოკური არეალი)
        თუ ცვლადს აღწერ ბლოკის შიგნით (მაგალითად, if, for, while, switch, try/catch), ის ხდება ბლოკური.
        ხელმისაწვდომობა: ასეთ ცვლადთან წვდომა გაქვს მხოლოდ იმ ბლოკის შიგნიდან, სადაც ის არის აღწერილი.
        გაფრთხილება: ბლოკური ცვლადები არ ჩანს ბლოკის გარეთ.
*/