let num = 18

if (num % 2 == 0){
    console.log("even")
} else {
    console.log("odd")
}


if (num % 3 == 0 && num % 5 == 0){
    console.log("ეს რიცხვი არის სამის და ხუთის ჯერადი")
} else if (num % 3 == 0 || num % 5 == 0){
    console.log("ეს რიცხვი არის სამის ან ხუთის ჯერადი")
} else {
    console.log("ეს რიცხვი არ არის არც სამის და არც ხუთის ჯერადი")
}


num % 2 == 0 ? console.log("even") : console.log("odd")


/*
    == - ადარებს მხოლოდ მნიშვნელობებს, ტიპების გაუთვალისწინებლად (მაგ: 5 == "5" არის true).
    === - ადარებს როგორც მნიშვნელობას, ისე მონაცემთა ტიპს (მაგ: 5 === "5" არის false).
    != - ამოწმებს, რომ მნიშვნელობები არ იყოს ერთმანეთის ტოლი (მაგ: 5 != 6 არის true).
    !== - ამოწმებს, რომ ან მნიშვნელობა ან ტიპი არ ემთხვეოდეს (მაგ: 5 !== "5" არის true).
    > - ამოწმებს, არის თუ არა მარცხენა რიცხვი მარჯვენაზე დიდი (მაგ: 10 > 5 არის true).
    < - ამოწმებს, არის თუ არა მარცხენა რიცხვი მარჯვენაზე ნაკლები (მაგ: 3 < 5 არის true).
    >= - ამოწმებს, არის თუ არა მარცხენა რიცხვი მარჯვენაზე მეტი ან მისი ტოლი (მაგ: 5  >= 5 არის true).
    <= - ამოწმებს, არის თუ არა მარცხენა რიცხვი მარჯვენაზე ნაკლები ან მისი ტოლი (მაგ: 4 <= 5 არის true).
    
    
    
    
    Falsy - მნიშვნელობები, რომლებიც ლოგიკურ კონტექსტში უდრის false-ს
    
    0 - რიცხვი ნული.

    "" - ცარიელი სტრინგი (ტექსტი).

    undefined - განუსაზღვრელი ცვლადი.
    
    
    
    Truthy - მნიშვნელობები, რომლებიც ლოგიკურ კონტექსტში უდრის true-ს
    
    1 - ნებისმიერი რიცხვი ნულის გარდა.

    "hello" - ნებისმიერი არაცარიელი ტექსტი.

    true - ბულიანი.
*/