# კომენტარი არის ტექსტი, რომელიც იგნორდება კომპიუტერით, რადგან იგი არის ინსტრუქცია ადამიანებისთვის, რომ უკეთესად გაიგონ კოდი
# კომენტარის დასაწერად ტექსტის წინ "#" უნდა დავწეროთ

# ქეის სენსიტიურობის დროს პროგრამირების ენა დიდ და პატარა ასოებს განსხვავებულ სიმბოლოებად მიიჩნევს, რადგან მათ განსხვავებული 
# ბინარული კოდი აქვთ
# მაგ: "N" არ არის "n",  "NAme" არ ნიშნავს "name"

# snake_case არის ქვედა ტირე, რომლის მეშვეობითაც ცვლადისთვის სახელის დაწერისას სიტყვების ერთმანეთისგან განცალკევება შეგვიძლია

user_name = "Demetre"
max_score = 250
is_logged_in = true

# debbuging-ი არის შეცდომით დაწერილ კოდში შეცდომების პოვნა და გასწორება

print("Hello World")
city="London"
print(city)

