# input-ი არის ნებისმიერი სახის ინფორმაცია, რომელიც მიეწოდება კომპიუტერს ან სხვა ნებისმიერ მოწყობილობას.
# მაგ: ტელეფონზე ლაპარაკი, ფოტოს გადაღება, ეკრანის გაზიარება, კამერის ჩართვა, კლავიატურაზე ღილაკების დაჭერა და ა. შ.


# output-ი არის input-ის საპირისპირო. კომპიუტერის ან სხვა ნებისმიერი დევაისის მიერ ინფორმაციის მიწოდება მომხმარებელს.
# მაგ: საიტებზე გადასვლისას კონტენტის ჩვენება მომხმარებელს, გადაღებული ფოტოს ნახვა, სხვის მიერ გაზიარებული ეკრანის ნახვა.


a = input("print adjective: ")
b = input("print noun: ")


c = int(input("1-st number: "))
d = int(input("2-nd number: "))
e = int(input("3-rd number: "))
f = int(input("4-th number: "))
g = int(input("5-th number: "))

print(a + b)
print(int((c+d+e+f+g)/5))
