num = int(input("enter number: "))

num1 = 1

for i in range(1, num + 1):
    num1 *= i

print("factorial =", num1)



# პროცენტული გაყოფა ხშირად გამოიყენება ფინანსებში, ანგარიშებში, სტატისტიკაში და სხვა სიტუაციებში, როცა საჭიროა მთლიანობის
# თანაფარდობის განსაზღვრა.

# მაგ: თუ გაქვს თანხა(150 ლარი) და გინდა გაიგო, ამ თანხის რამდენ პროცენტს შეადგენს 30 ლარი.
# ამისთვის ჩვენ უნდა გავყოთ მთლიანი თანხის გარკვეული ნაწილი(30 ლარი) მთლიან თანხაზე(150 ლარი) და გავამრავლოთ 100-ზე
# ჩვენს შემთხვევაში ეს იქნება: (30 / 150) * 100.    პასუხი: 20 პროცენტი.

# ასევე შეიძლება მოცემული გვქონდეს პირიქით. უნდა გავიგოთ, თუ რა ნაწილია მთლიანი რიცხვის რაღაც პროცენტი.
# მაგ:  170-ის რა ნაწილია 40 პროცენტი. (170 / 100) * 40.   პასუხი: 68.     


num2 = int(input("please enter number: "))

for i in range(1, num2 + 1):
    if num2 % i == 0:
        print(i)

