# sequensing - ინსტრუქციის ნაბიჯ-ნაბიჯ შესრულება.  მაგ: ბრაუზერის მიერ კოდის ზემოდან ქვემოთ წაკითხვა
# iteration - რაღაც მოქმედების გამეორება (ციკლი).  მაგ: ერთი და იგივე სიტყვის ბევრჯერ თქმა
# selection - არჩევანის გაკეთება, თუ რა მომდევნო მოქმედების შესრულებას აირჩევ.  მაგ: შუქნიშანზე დგომა. თუ მწვანეა-დაიძრები, თუ წითელი-არა

# ალგორითმი არის ინსტრუქციის შესრულების გარკვეული თანმიმდევრობა. მაგ: ღვეზელის რეცეპტი, დანიშნულების აგდილზე მისასვლელად მოსახვევების
# სწორი თანმიმდევრობა

# არსებობს ალგორითმის სამი სახეობა: flowchart, pseudocode, natural language.
# flowchart - დიაგრამა, ბლოკ-სქემა
# pseudocode - ნატურალურ ენასა და პროგრამირების ენის ოქროს შუალედი
# natural language - ჩვეულებრივი, სალაპარაკო ენა

name = "demetre"
name1 = input("enter your name: ")
print(name == name1)

# დაწყება

# დეკლარაცია
# "name" სახელის მოფიქრება
# ტოლობის ოპერატორის დაწერა
# "demetre" მნიშვნელობის მინიჭება

# დეკლარაცია
# "name1" სახელის მოფიქრება
# ტოლობის ოპერატორის დაწერა
# input-ში "gio"-ს შეტანა

# "name" და "name1"-ის შედარება
# თუ "name" უდრის "name1"-ს, მაშინ პასუხია - true
# თუ "name" არ უდრის "name1"-ს, მაშინ პასუხია - false

# დასრულება
         

